# Определяем размеры комнаты
length = 8  
width = 10  

# Рассчитываем площадь комнаты
area = length * width
print(f"Площадь комнаты: {area} квадратных метров")

# Исправляем длину
length = 20  # новая длина в метрах

# Рассчитываем новую площадь с исправленной длиной
new_area = length * width
print(f"Новая площадь комнаты с длиной 20 метров: {new_area} квадратных метров")

# площадь прямоугольника со сторонами 23 и 13
side1 = 23  
side2 = 13  

# площадь нового прямоугольника
rectangle_area = side1 * side2
print(f"Площадь прямоугольника со сторонами 23 и 13 метров: {rectangle_area} квадратных метров")
