import csv

# Данные сотрудников
employees = [
    ["ФИО", "Должность", "Дата найма", "Оклад"],
    ["Иванов Иван Иванович", "Менеджер", "22.10.2013", "250000"],
    ["Сорокина Екатерина Матвеевна", "Аналитик", "12.03.2020", "75000"],
    ["Струков Иван Сергеевич", "Программист", "23.04.2012", "150000"],
    ["Корнеева Анна Игоревна", "Ведущий программист", "22.02.2015", "120000"],
    ["Старчиков Сергей Анатольевич", "Младший программист", "12.11.2021", "50000"],
    ["Бутенко Артем Андреевич", "Архитектор", "12.02.2010", "200000"],
    ["Савченко Алина Сергеевна", "Старший аналитик", "13.04.2016", "100000"]
]

# Запись в CSV
with open('employees.csv', mode='w', newline='', encoding='utf-8') as file:
    writer = csv.writer(file)
    writer.writerows(employees)

print("CSV-файл успешно создан.")
