START_MSG =\
'''Выберите пункт меню (цифру):
0. Записать значения в файл (json или csv)
1. Вывод текущих данных
2. Начислить премии ко дню программиста
3. Начислить премию к 23 февраля или к 8 марта
4. Индексация зарплат
5. Получить список сотрудников, которым положен отпуск
6. Расчитать фонд оплаты труда
7. Построить столбчатую диаграмму по окладам
8. Расчитать налоговые отчисления
9. Выход из программы'''

WRITE_FILE_MSG =\
'''1. Записать в json
2. Записать в csv
9. Назад'''

MAN_WOMAN_PREM =\
'''1. Начислить премию к 23 февраля
2. Начислить премию к 8 марта
9. Назад'''

TAXES_TEXT =\
'''Желаете вывести значение для конкретного сотрудника или сохранить json файл для всех сотрудников?
1. Вывести для конкретного сотрудника (перейти к выбору)
2. Сохранить json файл с расчётом для всех сотрудников
9. Назад'''